[{
    "textColor": "black",
    "Id": 796868,
    "color": "#F0BCAB",
    "title": "What is Data Science?",
    "summary": "Panel Moderator: TBD<br><br>Panelists:<br><b>Maliaca Oxnam</b>, Deputy Director of the UArizona Data Science Institute<br><b>Vignesh Subbian</b>, Assistant Professor of Systems & Industrial Engineering and Biomedical Engineering, UArizona <br><b>Alise Ponsero</b>, Postdoc and Data Science Fellow, UArizona",
    "start": "2021-05-17 9:00:00",
    "end": "2021-05-17T10:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 464352,
    "color": "#F0BCAB",
    "title": "Careers in Data Science",
    "summary": "",
    "start": "2021-05-20T15:00:00Z",
    "end": "2021-05-20T16:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 143455,
    "color": "#F0BCAB",
    "title": "Hacky Hour",
    "summary": "",
    "start": "2021-05-20T17:00:00Z",
    "end": "2021-05-20T18:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 969028,
    "color": "#EA5A2A",
    "title": "Intro to Python I: Data",
    "summary": "From: Drake Asberry<br>This workshop will help researchers with no prior programming experience learn how to utilize Python to analyze research data. Attendees will learn how to open data files in Python, complete basic data manipulation tasks and save their work without compromising original data. Oftentimes, researchers find themselves needing to do the same task with different data and attendees will gain basic experience on how Python can help you make more efficient use of your time.",
    "start": "2021-05-17T10:00:00Z",
    "end": "2021-05-17T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 811653,
    "color": "#235387",
    "title": "Intro to R I",
    "summary": "From: Joel Parker<br>",
    "start": "2021-05-17T10:00:00Z",
    "end": "2021-05-17T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 764425,
    "color": "#EA5A2A",
    "title": "Intro to Python II: a tool for programming",
    "summary": "From: Drake Asberry<br>This workshop will help attendees build on previous knowledge of Python or another programming language in order to harness the powers of Python to make your computer work for you. Attendees will learn how to write their own Python functions, save their code as scripts that can be called from future projects and build a workflow to chain multiple scripts together.",
    "start": "2021-05-17T13:00:00Z",
    "end": "2021-05-17T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 342563,
    "color": "#235387",
    "title": "Intro to R II",
    "summary": "From: Joel Parker<br>",
    "start": "2021-05-17T13:00:00Z",
    "end": "2021-05-17T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 733251,
    "color": "#4A525A",
    "title": "Visualizing data with Vega-lite",
    "summary": "From: Kate Isaacs<br>Vega-Lite is a high-level grammar of interactive graphics. It provides a concise JSON syntax for rapidly generating visualizations to support analysis.",
    "start": "2021-05-17T15:00:00Z",
    "end": "2021-05-17T17:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 733351,
    "color": "#4A525A",
    "title": "Introduction to Unix",
    "summary": "From: Patrick Bunn & Izzy Viney<br>No prior command-line experience is required. If you have a windows machine we ask you to download Git (https://git-scm.com/downloads, a Unix Shell) ahead of the workshop, Mac and Linux users already have a Unix terminal.",
    "start": "2021-05-17T15:00:00Z",
    "end": "2021-05-17T17:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 354544,
    "color": "#4A525A",
    "title": "Package Management with Spack",
    "summary": "From: Anirban Pal<br>Spack is a package management tool designed to support multiple versions and configurations of software on a wide variety of platforms and environments. It was designed for large supercomputing centers, where many users and application teams share common installations of software on clusters with exotic architectures, using libraries that do not have a standard ABI. Spack is non-destructive: installing a new version does not break existing installations, so many configurations can coexist on the same system. <br><br>Most importantly, Spack is simple. It offers a simple spec syntax so that users can specify versions and configuration options concisely. Spack is also simple for package authors: package files are written in pure Python, and specs allow package authors to maintain a single file for many different builds of the same package. (https://spack.readthedocs.io/en/latest/)<br><Br>Pre-requisites: Familiarity with Linux command line, and some basic exposure to compiling software on linux systems.",
    "start": "2021-05-18 9:00:00",
    "end": "2021-05-18T10:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 354544,
    "color": "#EA5A2A",
    "title": "Intermediate Python with Testing and Types",
    "summary": "From: Ken Youens-Clark<br>",
    "start": "2021-05-18T10:00:00Z",
    "end": "2021-05-18T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 354244,
    "color": "#235387",
    "title": "Bayesian Analysis in R",
    "summary": "From: Kelly Heilman<br>In this workshop, we will cover the very basics of Bayesian Statistics, and go over an example of how to specify your first bayesian linear regression in R using JAGS!",
    "start": "2021-05-18T10:00:00Z",
    "end": "2021-05-18T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 939354,
    "color": "#235387",
    "title": "Beautiful Plots with ggplot2",
    "summary": "From: Kathryn Busby Rosa<br>Being able to create visualizations (graphical representations) of data is a key step in being able to communicate information and findings to others. In this module you will learn to use the ggplot2 library to declaratively make beautiful plots or charts of your data. Learning the framework for using this library will allow you to make nearly any kind of (static) data visualization, customized to your exact specifications.",
    "start": "2021-05-18T13:00:00Z",
    "end": "2021-05-18T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 939354,
    "color": "#235387",
    "title": "Unsupervized Machine Learning in R",
    "summary": "From: Karen De La Rosa<br>",
    "start": "2021-05-18T13:00:00Z",
    "end": "2021-05-18T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 868549,
    "color": "#4A525A",
    "title": "Blake's Declassified HPC Survival Guide",
    "summary": "From: Blake Joyce<br>The Univerisity of Arizona has two supercomputers (high performance computers or HPC). Soon we'll have 3. But using a supercomputer isn't like a regular one. I used to be a researcher and I remember how tough it was to get on the supercomputers and get work done.<br><br>In this class we'll go over brief concepts to help understand what these kinds of computers do, why you might want to use them in your research, and how to login and be a good community member. We'll submit a test job at the end; you'll walk away being able to tell your family and friends you used a supercomputer today. Follow up support is available through several channels.",
    "start": "2021-05-18T15:00:00Z",
    "end": "2021-05-18T17:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 652574,
    "color": "#4A525A",
    "title": "Intro to GitHub",
    "summary": "From: Jonathon King<br>This workshop is designed to introduce scientists and researchers to the Github platform. Participants will learn how to use Github to save a version history of files, back up work to the cloud, share work with collaborators, and use multiple versions of the same file. Workshop topics will include fundamental git concepts, creating repositories, backing up code with documentation and version control, and managing branches of a project.<li>Please sign up for a Github account if you do not already have one.</li><li>Please also install Github Desktop on your computer.</li><li>You will need access to a plain text editor. For example: Notepad, Textedit, Atom, Vi, etc. (Please do not use MS Word).</li>",
    "start": "2021-05-19T10:00:00Z",
    "end": "2021-05-19T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 652374,
    "color": "#235387",
    "title": "Shiny Dashboards in R",
    "summary": "From: Jeff Oliver",
    "start": "2021-05-19T10:00:00Z",
    "end": "2021-05-19T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "category": "time",
    "Id": 245953,
    "color": "#4A525A",
    "title": "Intro to LaTeX",
    "summary": "From: Peter Ore<br>It's fun to code things for computers to read, so why not code things for humans to read, too? With the LaTeX typesetting system, you can code professional quality equations, tables, figures, verse, novellas, and much more. This document preparation system -- used increasingly across the sciences -- offers many of the advantages of programming other steps of the research process: automation, customization, and replicability. Even better, using LaTeX means you can do the hard work (writing the thing) in your favorite plain text editor. Imagine writing without bells, whistles, or bossy paper clips! This workshop will emphasize the skills you will need to get started producing a basic manuscript for an academic article or essay.",
    "start": "2021-05-19T13:00:00Z",
    "end": "2021-05-19T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 456213,
    "color": "#4A525A",
    "title": "Minting DOIs for your awesome data/code with ReDATA",
    "summary": "From: Chun Ly<br>",
    "start": "2021-05-19T15:00:00Z",
    "end": "2021-05-19T16:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 413353,
    "color": "#4A525A",
    "title": "Scholarly identity and Measuring Researcher Impact",
    "summary": "From: Ellen Dubinsky<br>Scholarly identity and researcher visibility involve managing public information about you and your work in order to help raise your profile and promote your research. This information is relevant when we develop a narrative of the impact of our scholarly and creative work for a dossier for tenure or promotion, grant proposals, or for an academic program review. Learn how to take more control over your online identity, manage it more effectively, measure your impact, and most importantly maximize your impact as a researcher, author, and scholar.",
    "start": "2021-05-19T16:00:00Z",
    "end": "2021-05-19T17:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },

  {
    "textColor": "black",
    "Id": 562332,
    "color": "#EA5A2A",
    "title": "Data structures (pandas) and data visualization (matplotlib) in Python",
    "summary": "From: Artin Majdi<br>Initially, we'll go over how to use the panda package in Python to view and analyze data structures (excel, CSV, email, etc.). Then, in the second half of the session, we'll go over how to use matplotlib to visualize data in Python.",
    "start": "2021-05-19T15:00:00Z",
    "end": "2021-05-19T17:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 542532,
    "color": "#235387",
    "title": "Blogdown: Creating Websites with R Markdown",
    "summary": "From: Heidi Steiner<br>Want to build a website using RStudio? blogdown is an R package that allows you to create websites from RMarkdown files using Hugo, an open-source static site generator. I’ll show you how to get your own website running and give you the tools you need to write your own posts.",
    "start": "2021-05-20T09:00:00Z",
    "end": "2021-05-20T11:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 725348,
    "color": "#235387",
    "title": "Setiment Analysis with R",
    "summary": "From: Karen De La Rosa<br>",
    "start": "2021-05-20T10:00:00Z",
    "end": "2021-05-20T12:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 734176,
    "color": "#4A525A",
    "title": "Enhancing Data Visualizations with Inkscape",
    "summary": "From: Maria Trejo<br>This workshop will cover how to use Inkscape tools to edit titles, legends, axes and highlight areas of a plot. This workshop is designed for individuals who frequently develop data visualizations using statistical software, but do not necessarily have the coding background to make extensive edits. The workshop will focus on editing output graphics from R and SAS statistical software.",
    "start": "2021-05-20T13:00:00Z",
    "end": "2021-05-20T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 323257,
    "color": "#EA5A2A",
    "title": "Prefect (an Airflow alternative) for data pipelines in Python",
    "summary": "From:Frank Ventura<br>Prerequisites: Intro to Python I and II, or equivalent knowledge of Python",
    "start": "2021-05-20T13:00:00Z",
    "end": "2021-05-20T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 644819,
    "color": "#EA5A2A",
    "title": "Machine Learning with Scikit-Learn",
    "instructors": "",
    "duration": 120,
    "level": "Beginner",
    "summary": "From: Reza Ehsani<br>This workshop assumes that you know close to nothing about Machine Learning. Its goal is to introduce you to the concepts, tools, and intuition you need to implement programs capable of learning from data.<br>We will cover a few techniques, from the simplest and most commonly used Linear Regression to Decision Trees and Random Forests.<br>Rather than implementing our own toy versions of each algorithm, we will be using Scikit-Learn which is very easy to use, yet it implements many Machine Learning algorithms efficiently, so it makes for a great entry point to learning Machine Learning.",
    "start": "2021-05-21T10:00:00Z",
    "end": "2021-05-21T12:00:00Z"
  },
  {
    "textColor": "black",
    "Id": 102136,
    "color": "#EA5A2A",
    "title": "Machine learning lifecycle mangers: How mlflow can make our life easier",
    "summary": "From: Artin Majdi<br>Just a few of the complicated phases in the ML lifecycle are data processing, development, experimentation (along with the associated parameters, metrics, artifacts, source code, and package dependencies), deployment, and monitoring. To do so, we'll need a platform-agnostic framework that can track and facilitate all stages of development. I'll demonstrate you how mlflow will help us through these stages.",
    "start": "2021-05-21T13:00:00Z",
    "end": "2021-05-21T15:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  },
  {
    "textColor": "black",
    "Id": 456355,
    "color": "#EA5A2A",
    "title": "Basics of text processing with spaCy",
    "summary": "From: Damian Romero <br>In this workshop, we will dive into the basics of spaCy for text processing. spaCy is a free Natural Language Processing Python library developed specifically for production environments.<br>The first part will be dedicated to introducing spaCy and navigating through its documentation. Then, we will work in small groups and code. Using Jupyter notebooks, we will create a pipeline for text tokenization, part-of-speech tagging, parsing, and extractingnamed entities. We will dedicate the last 15 minutes to discussing the advantages of using spaCy and its ecosystem (Prodigy, Thinc, and other tools). <br>If you are interested in following along with the code, this link will provide information including an introduction to Jupyter notebooks: https://tinyurl.com/rb21-spacy",
    "start": "2021-05-21T15:00:00Z",
    "end": "2021-05-21T17:00:00Z",
    "instructors": "",
    "duration": 120,
    "level": "Beginner"
  }
]
